{
  "title": "Using the Inbox",
  "id": "inbox-intro",
  "section": "1.3. The Inbox",
  "intro": "Enterprise Users have the addition of the Inbox in their Dashboard configuration. The Inbox allows the management of Tasks within the Enterprise. In this section we will go in depth into the Inbox and using it on the web and the mobile apps.",
  "blocks": [
    {
      "type": "h1",
      "content": "1.3.1. Using the Inbox"
    },
    {
      "type": "h2",
      "content": "1.3.1.1. On the Web"
    },
    {
      "type": "text",
      "content": "As the Inbox is part of the Dashboard, it is the first thing that logged in Members of an Enterprise will see. Much like an email Inbox, the FieldLogs Inbox is the component that most Enterprise FieldLogs Member Users will use the most. To that end, the Inbox is fully enabled to allow Users to filter, sort and action on various types of Tasks."
    },
    {
      "type": "text",
      "content": "Below is an example of how the Dashboard changes when logged in as a Member of an Enterprise:"
    },
    {
      "type": "img",
      "img":"assets/images/doco-images/img_1-3-1-1-1.png",
      "imgAlt":"Image Alt"
    },
    {
      "type": "h2",
      "content": "1.3.1.2. On mobile devices"
    },
    {
      "type": "text",
      "content": "On mobile devices the Inbox is a separate tab with a similar display of Tasks as on the web. Whether you are on a mobile device on the move, or on the web, an Enterprise member will easily recognise their Tasks and filter consistently. An additional organization is available on the devices that separate Overdue, Current and Past Tasks. These sections are collapsible and expandable to help focus when on the move."
    },
    {
      "type": "image",
      "img":"assets/images/doco-images/img_1-3-1-2-1.png",
      "imgAlt":"Image Alt",
      "caption": "Much like on the Jobs and Templates list, if the User would like to access a different action than the default, he/she simply has to tap on a Task to access the sliding action menu on the right. <br><br>Options availabe here include control to re-assign, archive, mark as done and more."
    }
  ]
}
