{
  "title": "Tasks & Task Types",
  "id": "tasks-types",
  "section": "1.3. The Inbox",
  "intro": "The Inbox is built to collect Tasks generated by the Enterprise-only Assignment and Lifecycle features. To assist collaboration between Enterprise Users, FieldLogs treats Tasks as a means of communicating what work needs to be done within the Enterprise. Here we are going to take an in-depth look at what a Task is and why it's useful.",
  "blocks": [
    {
      "type": "h1",
      "content": "1.3.1. Tasks & Task Types"
    },
    {
      "type": "h2",
      "content": "1.3.1.1. Introduction to Tasks in FieldLogs"
    },
    {
      "type": "text",
      "content": "A Task in FieldLogs is essentially a message between 2 or more Members of an Enterprise. Tasks can be thought of as emails or messages between Members to facilitate collaboration. A single Task communicates a range of information but most importantly:"
    },
    {
      "type": "bullet",
      "points": [
        {
          "text":"The status of an assigned Template & Job or the stage of a Template submitted to a Lifecycle"
        },
        {
          "text":"What needs to be done (an Action) to advance the Task towards completion."
        }
      ]
    },
    {
      "type": "text",
      "content": "A Task that appears in a Users Inbox will need action to be taken by the User since Tasks are assigned to an individual User uniquely by others (in assignment of Jobs or Templates) or to a specific Role (in Lifecycle flows). A specific action is shown by default in a Tasks cell but often there are more that can be selected from the the action button dropdown."
    },
    {
      "type": "h2",
      "content": "1.3.1.2. Lifecycle Tasks"
    },
    {
      "type": "text",
      "content": "Lifecycle Tasks are Tasks associated with Template Lifecycles. In the Inbox, they communicate to Members within various Roles at what stage a Template is within the Lifecycle. Once viewed, the Template has it's specific actions that need to be performed before it can be moved to the next stage in the Lifecycle."
    },
    {
      "type": "img",
      "img":"assets/images/doco-images/img_1-3-1-2-1.png",
      "imgAlt":"Image Alt"
    },
    {
      "type": "text",
      "content": "The key components of a Lifecycle Task are:"
    },
    {
      "type": "bullet",
      "points": [
        {
          "text":"Label indicating at what stage the given Template is at within the Lifecycle (title next to Label)."
        },
        {
          "text":"The Template name that the Task refers to."
        },
        {
          "text":"A View action to open the Template in the editor and continue to complete what needed of the Task."
        }
      ]
    },
    {
      "type": "info",
      "content": "In contrast to assignment Tasks, Lifecycle Tasks do not have due dates so this is not shown in the cell in the Inbox."
    },
    {
      "type": "h2",
      "content": "1.3.1.3. Assignment Tasks"
    },
    {
      "type": "text",
      "content": "Assignment Tasks are created when a User assigns a Template or an existing Job to another Member in the Enterprise. Assignment Tasks have a due date applied to them therefore they become the key component to getting the standard work Templates, created with Lifecycles, done in the Field. This action creates essentially two Tasks, one in each Inbox (assigner & assignee):"
    },
    {
      "type": "text",
      "content": "A 'Sent' Task is created by the assigner once the Template or Job has been assigned. This Task is a simple information Task that is meant to act as a record of assignment for the assigner. It is identified by it's small icon <i class='fa fa-mail-reply'></i> on the left side of the cell."
    },
    {
      "type": "img",
      "img":"assets/images/doco-images/img_1-3-1-3-1.png",
      "imgAlt":"Image Alt"
    },
    {
      "type": "text",
      "content": "In the assignee's Inbox, however, the Task takes the form of a normal 'todo' Task. The difference is obvious with the change of icon <i class='fa fa-pencil'></i> and the large orange 'Run' action:"
    },
    {
      "type": "img",
      "img":"assets/images/doco-images/img_1-3-1-3-2.png",
      "imgAlt":"Image Alt"
    },
    {
      "type": "info",
      "content": "Of particular note is the different From/To information displayed. On the 'Sent' task we display 'To' who is was assigned whereas on the 'todo' Task we show 'From' who it has come from."
    },
    {
      "type": "h2",
      "content": "1.3.1.4. Task Status"
    },
    {
      "type": "text",
      "content": "Tasks can have a variety of status' depending on the actions and states they are in/already have been in. Below is a list that hopes to explain all the available status' and what they mean for assignment Tasks:"
    },
    {
      "type": "bullet",
      "points": [
        {
          "text":"<b>New: </b> Tasks which are new to the Inbox. They have not been actioned on or viewed yet."
        },
        {
          "text":"<b>Open: </b> Tasks that have been viewed but not yet ran by the User."
        },
        {
          "text":"<b>Started: </b> Tasks that have been started are Tasks that have been run and therefore have data related to them, i.e. a Job. "
        },
        {
          "text":"<b>Error: </b> Task where there is an issue with access rights or with data. Here in most cases the Task will inform the User what the problem is."
        },
        {
          "text":"<b>Done: </b> Tasks that have been marked as done by either the assigner or assignee."
        },
        {
          "text":"<b>Archived: </b> Archived Tasks are Tasks marked as not being relevant anymore. This is a Task that is, for example, very old and has been superseded by another."
        }
      ]
    }
  ]
}
