{
  "title": "4.1. Enterprise Introduction",
  "id": "enterprise-intro",
  "intro": "",
  "blocks": [
    {
      "type": "h1",
      "content": "4.1.1. What is FieldLogs Enterprise?"
    },
    {
      "type": "text",
      "content": "FieldLogs Enterprise is a product upgrade which enables an advanced set of features tailored at groups of individuals such as small businesses, research expert groups or large company organisations. Key improvement of Enterprise is the ability to collectively author, review and publish Templates through Lifecycles (a governance process) as well as managing Tasks (such as authoring Templates or assigning, following or viewing Jobs) to Members within the Enterprise. Alongside all of this, everything is managed with granular authorization security."
    },
    {
      "type": "text",
      "content": "FieldLogs Enterprise lets organizations define what processes they want to run in the field. It lets such organizations run them, collaborate around them, and finally govern them flexibly."
    },
    {
      "type": "text",
      "content": "Below is a summary of some of the Enterprise features:"
    },
    {
      "type": "bullet",
      "points": [
        {
          "text":"Enterprise Roles & Rules (Template and Job access authorization, Enterprise administration)"
        },
        {
          "text":"Lifecycle Template definition for various business contexts. Maps directly to Member Roles."
        },
        {
          "text":"Collaborative Jobs and Tasks assignment from Member Roles via Templates."
        },
        {
          "text":"Inbox to allow Members to filter & view the progress of Tasks assigned to others."
        },
        {
          "text":"Granular Search through Enterprise data."
        }
      ]
    },
    {
      "type": "info",
      "content": "You will need to have upgraded your account or have accepted an invitation be able to use these additional features. See <a href='#/section/enterprise-setup/upgrading'>'Upgrading Accounts'</a> in the 'Setting up an Enterprise' section if you have not done so already."
    },
    {
      "type": "info",
      "content": "The Single user version of FieldLogs lets an individual user author, run, or share any process (Template and Job). It will not be as handy or secure for a group of users to work together."
    }
  ]
}
