{
  "title": "1.1. Introduction to Templates",
  "id": "templates-intro",
  "intro": "A core concept in FieldLogs is the concept of a Template. In this Section we will introduce the concept of a Template, how to create your own and we will go into detail about all the different aspects and usage of a Template within FieldLogs.",
  "blocks": [
    {
      "type": "h1",
      "content": "1.1.1. What is a Template?"
    },
    {
      "type": "text",
      "content": "Templates within FieldLogs are structured workflow definitions built using common user interface components (input fields, text, media) that allow a creator of a Template to accurately define Standard Work procedures. A FieldLogs template has additional elements that make it particularly useful for this Role. Below are some of these:"
    },
    {
      "type": "bullet",
      "points": [
        {
          "text":"Structural elements like Labels, Tables, Forms and Loops that allow the creator of a template to give some logical structure depending on their data acquisition needs. (See more under 'Template Anatomy')"
        },
        {
          "text":"Various types of Input elements such as Yes/No, Multi-choice, Check or Free text Input to easily Input various types of data."
        },
        {
          "text":"The ability to mark Templates as private (for your use only) or public (for sharing with others through email)"
        },
        {
          "text":"Ability to add translations of a Template for different languages. (<a href='#/section/augmenting-templates/translations'>More Info</a>)"
        },
        {
          "text":"Add documentation and rich media to Steps in the Template to guide user executing Templates. Think of this as a way to provide detailed reference material while 'on the job'. (<a href='#/section/augmenting-templates/attach-documentation'>More Info</a>)"
        },
        {
          "text":"Add powerful script execution that can help you build computation & external calls to other services right into your Templates. (<a href='#/section/augmenting-templates/scripting'>More Info</a>)"
        }
      ]
    },
    {
      "type": "h2",
      "content": "1.1.1.1. Template List"
    },
    {
      "type": "image",
      "img":"assets/images/doco-images/img_1-0-3.png",
      "imgAlt":"Image Alt",
      "caption": "Templates on the web and on our mobile apps can be easily recognized as a simple list item displaying the information as shown here. On the web you can view available actions by using the button to the right of the cell."
    },
    {
      "type": "image",
      "img":"assets/images/doco-images/img_1-0-4.png",
      "imgAlt":"Image Alt",
      "caption": "Templates list in the iOS application. The main difference is to access actions relating to a Template one must tap on a Template to access it's Action side menu."
    },
    {
      "type": "h1",
      "content": "1.1.2. Running Templates"
    },
    {
      "type": "text",
      "content": "Not only can you create your own Templates using FieldLogs but you can also 'Run' your Templates directly from the Web or on your mobile devices. Running a Template simply means to use the procedure defined in the Template to acquire data about that procedure. In FieldLogs, this is then called a Job."
    },
    {
      "type": "h2",
      "content": "1.1.2.1. Jobs"
    },
    {
      "type": "text",
      "content": "Jobs are evidentary records of the acquisition of data using a Template. "
    }
  ]
}
