{
  "title": "Labels",
  "id": "labels",
  "section": "1.2. Template Anatomy",
  "intro": "",
  "blocks": [
    {
      "type": "h1",
      "content": "1.2.1. Labels"
    },
    {
      "type": "h2",
      "content": "1.2.1.1. What are Labels?"
    },
    {
      "type": "text",
      "content": "A Label is not an active component of a workflow, in the sense that users do no interact with it. It is used to create headers to a workflow section or to synthesize a question asked to users in order not to repeat unnecessary information. On the Template a Label comprises of a chunk of text that will be displayed as is when users run the template."
    },
    {
      "type": "h2",
      "content": "1.2.1.2. Creating Labels in the Editor"
    },
    {
      "type": "img",
      "img":"assets/images/doco-images/img_1-2-1-2.png",
      "imgAlt":"Image Alt"
    },
    {
      "type": "numbers",
      "points": [
        {
          "text":"Select the Label Step icon: <i></i>"
        },
        {
          "text":"Choose where you want to put the Label Step in the orange bar below"
        },
        {
          "text":"Add Label text to the input field"
        },
        {
          "text":"Validate the Step by clicking the green tick: <i></i>"
        }
      ]
    },
    {
      "type": "h2",
      "content": "1.2.1.3. Usage examples"
    },
    {
      "type": "image",
      "img":"assets/images/doco-images/img_1-1-2.png",
      "imgAlt":"Labels on iOS",
      "caption": "<b>Labels display the web</b><br/>A <i></i> Label was created to separate the different phases of a diagnostics procedure. It allows to visually create a separator between the different section of this template."
    },
    {
      "type": "image",
      "img":"assets/images/doco-images/img_1-1-3.png",
      "imgAlt":"Labels on iOS 2",
      "caption": "<b>Labels display on mobile devices</b><br/> For a different template created to separate the different phases of a surgical procedures SOP, another <i></i> Label was used to synthesize a piece of information that would otherwise be repeated, in this case “Does the patient have a”, making the template easier to read and to act upon."
    },
    {
      "type": "info",
      "content": "You can easily fold and unfold any structural element containing other elements. Simple tap on the arrow on the right of the element cell in the table."
    }
  ]
}
