{
  "title": "Loops",
  "id": "loops",
  "section": "1.2. Template Anatomy",
  "intro": "",
  "blocks": [
    {
      "type": "h1",
      "content": "1.2.5. Loops"
    },
    {
      "type": "h2",
      "content": "1.2.5.1. What are Loops?"
    },
    {
      "type": "text",
      "content": "Loops <i></i> are a way to iterate multiple times through a set of questions or tasks. Loops can “embed” any of the step types exiting in the system, marking it highly powerful."
    },
    {
      "type": "h2",
      "content": "1.2.5.2. Creating Loops in the Editor"
    },
        {
      "type": "img",
      "img":"assets/images/doco-images/img_1-2-5-2.png",
      "imgAlt":"Image Alt"
    },
    {
      "type": "numbers",
      "points": [
        {
          "text":"Select the Loop Step icon: <i></i>"
        },
        {
          "text":"Choose where you want to put the Loop Step in the orange bar below"
        },
        {
          "text":"Add Loop text to the input field"
        },
        {
          "text":"Set the amount of iterations"
        },
        {
          "text":"Add different <a href='#/section/template-anatomy/input-elements'>Input elements</a> into the Loop Step to loop over"
        },
        {
          "text":"Validate the Step by clicking the green tick: <i></i>"
        }
      ]
    },
    {
      "type": "h2",
      "content": "1.2.5.3. Usage examples"
    },
    {
      "type": "image",
      "img":"assets/images/doco-images/img_1-2-5.png",
      "imgAlt":"Loops on iOS",
      "caption": "Under (2.2.1) is a loop to collect two pieces of information, a location and cable run. In this example, users where required to iterate through various on-site locations."
    },
    {
      "type": "image",
      "img":"assets/images/doco-images/img_1-2-5-1.png",
      "imgAlt":"Loops on iOS",
      "caption": "Once done with the first location, a user would enter values for the next location by tapping on “Create Next Iteration” (previous screen). Loops <i></i> can have a fixed number of iterations or can be infinite. The current number of iterations is displayed in a badge next to the related question or task. In this example, there are two iterations."
    },
    {
      "type": "info",
      "content": "You can easily fold and unfold any structural element containing other elements. Simple tap on the arrow on the right of the element cell in the table."
    }
  ]
}
