{
  "title": "Tasks",
  "id": "tasks",
  "section": "1.4. Template Anatomy",
  "intro": "",
  "blocks": [
    {
      "type": "h1",
      "content": "1.4.2. Tasks"
    },
    {
      "type": "h2",
      "content": "1.4.2.1. What are Tasks?"
    },
    {
      "type": "text",
      "content": "A <i style='color:orange;' class='fl-wf_step'></i> Task helps Template designers in grouping subsequent actions that have a logical connection. Tasks are semi-active components as they do not directly collect data from users. They help organize the data collection strategy. They are elements that are collapsible, helping users navigating through their workflow. It is especially useful for use with reduced screen sizes."
    },
    {
      "type": "h2",
      "content": "1.4.2.2. Creating Tasks in the Editor"
    },
        {
      "type": "img",
      "img":"assets/images/doco-images/img_1-2-2-2.png",
      "imgAlt":"Image Alt"
    },
    {
      "type": "numbers",
      "points": [
        {
          "text":"Select the Task Step icon: <i style='color:orange;' class='fl-wf_step'></i>"
        },
        {
          "text":"Choose where you want to put the Task Step in the orange bar below"
        },
        {
          "text":"Add Task text to the input field"
        },
        {
          "text":"Validate the Step by clicking the green tick: <i style='color:#639A2E;' class='fa fa-check-circle'></i>"
        }
      ]
    },
    {
      "type": "h2",
      "content": "1.4.2.3. Usage examples"
    },
    {
      "type": "image",
      "img":"assets/images/doco-images/img_1-2-2.png",
      "imgAlt":"Tasks on web",
      "caption": "<b>Tasks display the web</b><br/>This Template uses a Task to logically group the following three instructions. At the bottom a button exists that marks the entire Task as done, validating all inputs contained within it. This will collapse the Task automatically."
    },
    {
      "type": "info",
      "content": "You can easily fold and unfold any structural element containing other elements. Simple tap on the arrow on the right of the element cell in the table."
    },
    {
      "type": "image",
      "img":"assets/images/doco-images/img_1-2-2-1.png",
      "imgAlt":"Tasks on web",
      "caption": "<b>Tasks display the mobile devices</b><br/>The display of Tasks on the mobile devices is much like the web. You may also notice additionally a small red number above the collapse button that indicates the number of required inputs of a given Task."
    }
  ]
}
