{
  "title": "Lifecycle Stages & the Inbox",
  "id": "inbox",
  "section": "3.4. Template Edition Platform",
  "intro": "Most Members of an Enterprise will engage with Lifecycles through the general concept of the Template Edition Platform. This is a term used to describe the collaborative creation, reviewing and approval of Templates by various Members in the Enterprise. In this section we are going to break down this platform and explore how Lifecycles drive the collaboration between Members on FieldLogs.",
  "blocks": [
    {
      "type": "h1",
      "content": "3.4.1. Lifecycle Stages & The Inbox"
    },
    {
      "type": "text",
      "content":"As Templates submitted to Lifecycles move through the it's stages, FieldLogs generates notifications. The Inbox collects these notifications generated by the edition platform, called Tasks, so that Members of an Enterprise get a tailored, up to date view of Template states and any actions required to move a Template to eventual completion. Lifecycle Tasks require a Member with an appropriate Role to take action. Whether a Member sees a Lifecycle Task in their Inbox depends on two things:"
    },
    {
      "type": "numbers",
      "points": [
        {
          "text":"Whether the Member has the Role required to act on the Lifecycle itself. Said otherwise, whether the Member has the required data scope that includes the Lifecycle in which the Template is being processed."
        },
        {
          "text":"Whether he has the Role required for that specific Lifecycle stage. A Stage labelled 'Edit' linked to a Role called 'Author' for example, will require the Member to have the 'Author' Role assigned to them."
        }
      ]
    },
    {
      "type": "h2",
      "content": "3.4.1.1. The Inbox & Lifecycle Tasks"
    },
    {
      "type": "text",
      "content":"A Lifecycle Task (among many other types of Tasks) are displayed on the Dashboard inside your Inbox. Your Inbox, much like you email inbox, collects Tasks specifically related to you as a Member of an Enterprise. Below we identify a Lifecycle Task in an Inbox and deconstruct it:"
    },
    {
      "type": "img",
      "img":"assets/images/doco-images/img_2-4-1-1.png",
      "imgAlt":"Lifecycle Task cell"
    },
    {
      "type": "text",
      "content":"The Lifecycle Task cell contains a variety of information to identify, namely, which Lifecycle the Task has been generated from, which Template is being authored and at what stage the Template is in the Lifecycle."
    },
    {
      "type": "h2",
      "content": "3.4.1.2. Filtering Lifecycle Tasks"
    },
    {
      "type": "image",
      "img":"assets/images/doco-images/img_2-4-1-2.png",
      "imgAlt":"Inbox filters",
      "caption": "A simple way to see only Lifecycle Tasks is to use the filter bar at the top of the Inbox. Simply toggle all the other types of Tasks off and make sure the <i></i> Lifecycle Tasks is the only icon with an orange selected bar."
    }
  ]
}
