{
  "title": "Assigning a Job",
  "id": "assign-job",
  "section": "4.5. Collaborative Jobs",
  "intro": "Jobs that have been started from a Template can sometimes need the involvement of multiple Members to complete. For example, a specific Template might require two stages of work in different locations by different departments to complete. This is where assignment of the continuation of a Job becomes useful",
  "blocks": [
    {
      "type": "h1",
      "content": "4.5.2. Assigning an existing Job"
    },
    {
      "type": "text",
      "content":"Members of an Enterprise have the ability to assign Jobs to anybody else in the Enterprise. The same logic applies to Jobs as to Templates. Jobs need to be shared to the enterprise or be Public to be able to be assigned. If the assignee does not have sufficient permissions to view the Job or the Template from which it is based, it will result in an error in the assignees Inbox."
    },
    {
      "type": "warn",
      "content": "Security restrictions apply on the side of the assignee. The Task generated will show correctly only if the Member has the correct permissions to view the Job being assigned. If not, the assignee will see a Task error in their Inbox. See more about <a href='#/section/collaborative-jobs/errors'>Issues & Errors</a>"
    },
    {
      "type": "text",
      "content":"Job assignment can be done on both the web and on our mobile devices. Below we detail how to do so on both:"
    },
    {
      "type": "h2",
      "content": "4.5.2.1. Assigning a Job from the web"
    },
    {
      "type": "image",
      "img":"assets/images/doco-images/img_4-5-2-1.png",
      "imgAlt":"Image Alt",
      "caption": "Jobs can be assigned from either the Job list on the Dashboard or from the Jobs section. In this example we show assignment from the Job section which is achieved using the action dropdown on the Job cell. At this point the user will see a very similar assignment window as is show in <a href='#/section/collaborative-jobs/assign-template'>Assigning a Template</a>."
    },
    {
      "type": "h2",
      "content": "4.5.2.2. Assigning a Job from the App"
    },
    {
      "type": "image",
      "img":"assets/images/doco-images/img_4-5-2-2.png",
      "imgAlt":"Image Alt",
      "caption": "From the App (Android, iPhone & iPad) the assignment can be achieved by selecting a Job from the Jobs tab and finding the correct action from the Action Panel. At this point the user will see a very similar assignment screen as is show in <a href='#/section/collaborative-jobs/assign-template'>Assigning a Template</a>.<br/><br/>Much like with the assignment of Templates, the assigner will receive a Sent Task in their Inbox allowing them to follow any progress like Real-Time acquisition or if the Task is marked as completed by the assignee."
    }
  ]
}
