{
  "title": "Re-assigning or Sharing a Task",
  "id": "share-reassign",
  "section": "2.5. Collaborative Jobs",
  "intro": "There are often circumstances in the day to day assignment of Templates and Jobs in an Enterprise that require more individuals to be kept up to date on a running Job or Tasks to be re-assigned to other members due to member absence and other such situations. FieldLogs provides a few useful tools that we detail here.",
  "blocks": [
    {
      "type": "h1",
      "content": "2.5.3. Re-assignment and Sharing a Task"
    },
    {
      "type": "text",
      "content":"Tasks may need to be re-assigned or shared to other members by the original assignee. Re-assigning a Task simply creates a new assignment task for the member that it is being re-assigned to. The original assigner and the member re-assigning will both have a 'Sent' task in their Inboxes allowing them to follow the progress of the task if ran."
    },
    {
      "type": "text",
      "content":"Sharing tasks to other members is a simple way to inform other members of a task that they have been assigned. Think of this as a 'CC' of a task, much like the feature when sending emails."
    },
    {
      "type": "h2",
      "content": "2.5.3.1 Re-assigning a Task"
    },
    {
      "type":"text",
      "content":"From the web, this can be easily achieved by using the Action button dropdown and selecting Re-assign. Much like the Assignment pop up window, the resulting popup window allows the member to choose who to re-assign the task to and to then confirm that choice."
    },
    {
      "type": "img",
      "img":"assets/images/doco-images/img_2-5-2-8.png",
      "imgAlt":"Image Alt"
    },
    {
      "type": "image",
      "img":"assets/images/doco-images/img_2-5-2-9.png",
      "imgAlt":"Image Alt",
      "caption": "From the app re-assignment can be achieved by tapping on a task and choosing Re-assign from the Action panel. Following the on screen member selection screen allows the member to confirm the re-assignment."
    },
    {
      "type": "h2",
      "content": "2.5.3.2. Sharing a Task"
    },
    {
      "type":"text",
      "content":"Members have the ability to 'share' Tasks with members other than the assigner. This allows those members to follow the progress of the Task giving them access to follow in Real-Time job acquisition."
    },
    {
      "type": "warn",
      "content": "Sharing tasks can only be done once Tasks have been 'Started', i.e. there is already an acquisition (Job) in progress."
    },
    {
      "type":"text",
      "content":"From the web, much like re-assigning a task, the member opens the Action button dropdown and select Share. This opens a similar pop up window in which the member must confirm the member to share with."
    },
    {
      "type": "img",
      "img":"assets/images/doco-images/img_2-5-2-10.png",
      "imgAlt":"Image Alt"
    },
    {
      "type": "image",
      "img":"assets/images/doco-images/img_2-5-2-11.png",
      "imgAlt":"Image Alt",
      "caption": "From the app, the member selects Share from the Action panel. A Member selection screen similar to re-assigning a task then allows the successful sharing of a task."
    }
  ]
}
