{
  "title": "Member Management",
  "id": "member-management",
  "section": "3.3. Setting up an Enterprise",
  "intro": "Managing your Enterprise users is a key activity in FieldLogs.",
  "blocks": [
    {
      "type": "h1",
      "content": "3.3.3. Member Management"
    },
    {
      "type": "text",
      "content":"FieldLogs Enterprise lets you to manage the Members of your Enterprise right alongside the structure of your Enterprise Hierarchy. You assign Members to the various groups and subdivisions of your organization structure simply by selecting that group and entering the Member's email, in effect inviting them. This is a first step in managing the access scope that Members will inherit."
    },
    {
      "type": "warn",
      "content": "Make sure to use a valid email when adding Members. New Members will be sent an email to the address you type in informing them they have been invited to join the Enterprise. They will need to confirm this using a link sent to that email address."
    },
    {
      "type": "h2",
      "content": "3.3.3.1. Adding a Member"
    },
    {
      "type": "image",
      "img":"assets/images/doco-images/img_2-3-3-1.png",
      "imgAlt":"Image Alt",
      "caption": "Begin by typing the full email address of the user you wish to add to a certain Group in your Enterprise Hierarchy."
    },
    {
      "type": "image",
      "img":"assets/images/doco-images/img_2-3-3-2.png",
      "imgAlt":"Image Alt",
      "caption": "Hit enter on your keyboard to add the email to the Members list of the Group. The input field also doubles as a search field for existing Members. Therefore as you type the list will be filtered to reveal if the email your entered already exists."
    },
    {
      "type": "image",
      "img":"assets/images/doco-images/img_2-3-3-3.png",
      "imgAlt":"Image Alt",
      "caption": "Once the user has been added to the list, you need to complete the process by inviting the user by clicking the Invite to Enterprise button. Alternatively if you have added a number of emails you can simply click Invite all in the top bar of the Enterprise Members to invite all outstanding additions to the Members list."
    },
    {
      "type": "image",
      "img":"assets/images/doco-images/img_2-3-3-4.png",
      "imgAlt":"Image Alt",
      "caption": "Either before or after the user has been invited, it is possible (and recommended) to assign a specific Role granting, or limiting, them access to various Resources of FieldLogs Enterprise. <a href='#/section/enterprise-setup/security'>View our page</a> on Security to understand the concept of Roles & Rules in FieldLogs"
    },
    {
      "type": "info",
      "content": "If you believe you have made a mistake in the email you entered, you can simple remove the Member from the list and re-type the correct email, hitting enter again to add them to the Member list and finally, inviting that user to the Enterprise by clicking the Invite to Enterprise button."
    }
  ]
}
